synth-server/app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings"
---
  def index
    settings = Setting.all

SELECT "settings".* FROM "settings" WHERE "settings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    setting = Setting.find(params[:id])

INSERT INTO "settings" ("name", "gain", "stop_time", "a_frequency", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "settings" ("name", "gain", "stop_time", "a_frequency", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", ""], ["gain", 0.08], ["stop_time", 3000.0], ["a_frequency", 220.0], ["category_id", 5], ["created_at", "2020-07-30 03:30:37.961827"], ["updated_at", "2020-07-30 03:30:37.961827"]]
---
  def create
    setting = Setting.create(setting_params)
    if setting.create

SELECT "settings".* FROM "settings" WHERE "settings"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "settings" SET "a_frequency" = $1, "category_id" = $2, "updated_at" = $3 WHERE "settings"."id" = $4  [["a_frequency", 230.0], ["category_id", 14], ["updated_at", "2020-07-30 15:07:26.899582"], ["id", 10]]
---
  def update
    setting = Setting.find(params[:id])
    if setting.update(setting_params)

SELECT "settings".* FROM "settings" WHERE "settings"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "settings" WHERE "settings"."id" = $1  [["id", 10]]
---
  def destroy
    setting = Setting.find(params[:id])
    setting.destroy